БИТУправление_медицинским_центром_демо/src/InformationRegisters/ДействиеСкидок/ДействиеСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДействиеСкидок</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>удалитьДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>удалитьДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидСкидки</name>
    <type>
      <types>CatalogRef.ВидыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.КартыСкидок</types>
      <types>CatalogRef.ВидыКартСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыСкидок/ТипыСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСкидок</name>
  <enumValues>
    <name>Бонусы</name>
  </enumValues>
  <enumValues>
    <name>НакопительнаяСкидка</name>
  </enumValues>
  <enumValues>
    <name>Скидка</name>
  </enumValues>
  <enumValues>
    <name>Купоны</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыСкидок/ВидыСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСкидок</name>
  <attributes>
    <name>ВестиУчетПоНомерамКупонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолучателя</name>
    <type>
      <types>EnumRef.ВидПолучателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйОтборНакопления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтдельныйПериодНакопления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодАктивацииНачисленногоБонуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокСгоранияБонуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидки</name>
    <type>
      <types>EnumRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСкидки</name>
    <type>
      <types>EnumRef.ФормыСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтборНакопления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НоминалБонуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакоплениеБонусов</name>
    <comment>Способ расчета накопления бонусов</comment>
    <type>
      <types>EnumRef.ФормыСкидки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьПоДнямНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммируемаяСкидка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммоваяСкидкаНаКаждуюЕдиницу</name>
    <comment>Применять суммовую скидку на каждую единицу услуги</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БонусыНеНачислятьНаПозицииСоСкидкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БонусыЗапретитьОплачиватьПозицииСоСкидкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазмерыСкидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмерыНакопления</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.КатегорииВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВремяПоДнямНедели</name>
    <comment>Время действия скидки</comment>
    <attributes>
      <name>Выбран</name>
      <comment>Признак выбранного дня недели</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <comment>День недели</comment>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <comment>Время начала действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>Время окончания действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставНатуральнойСкидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШкалаДиапазонов</name>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПорога</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/CommonModules/РаботаСоСкидкамиПовтИсп/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Есть ли натуральные скидки с номенклатурой, в которой ведется учет по характеристикам
// 
// Возвращаемое значение:
//   Булево.
//
Функция ЕстьНатуральныеСкидкиСХарактеристиками() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыСкидокСоставНатуральнойСкидки.Ссылка
	|ИЗ
	|	Справочник.ВидыСкидок.СоставНатуральнойСкидки КАК ВидыСкидокСоставНатуральнойСкидки
	|ГДЕ
	|	(ВидыСкидокСоставНатуральнойСкидки.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|			ИЛИ ВидыСкидокСоставНатуральнойСкидки.Номенклатура.ВестиУчетПоХарактеристикам)"
	;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Есть ли действующие бонусные скидки
// 
// Возвращаемое значение:
//   Булево.
//
Функция ЕстьДействующиеБонусныеСкидки() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Дата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДействиеСкидок.ВидСкидки КАК ВидСкидки
	|ИЗ
	|	РегистрСведений.ДействиеСкидок КАК ДействиеСкидок
	|ГДЕ
	|	(ДействиеСкидок.ДатаОкончанияДействия > &Дата
	|	ИЛИ ДействиеСкидок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
	|	И ДействиеСкидок.ВидСкидки.ТипСкидки = ЗНАЧЕНИЕ(Перечисление.ТипыСкидок.Бонусы)"
	;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Есть ли в справочнике ВидыСкидок скидки, отбор которых использует данные ссылки документа продажи.
// 
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьСкидкиТребующиеЗаписьДокумента(Дата) Экспорт
	
	Дата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДействиеСкидок.ВидСкидки.ХранилищеОтбор КАК ХранилищеОтбор
	|ИЗ
	|	РегистрСведений.ДействиеСкидок КАК ДействиеСкидок
	|ГДЕ
	|	(ДействиеСкидок.ДатаОкончанияДействия > &Дата
	|	ИЛИ ДействиеСкидок.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))";

	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		 	
		ЭлементыКомпоновки = Выборка.ХранилищеОтбор.Получить().Отбор.Элементы;
		
		Для Каждого Элемент Из ЭлементыКомпоновки Цикл
			ЕстьОтбор = ЕстьОтборСкидкиПоПолямСсылкиДокумента(Элемент); 
			Если ЕстьОтбор Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции    

Функция ЕстьОтборСкидкиПоПолямСсылкиДокумента(ЭлементОтбора)
	
	Если ЭлементОтбора.Использование Тогда
		// Группа элементов отбора
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных")Тогда
			Для Каждого ЭлементГруппы Из ЭлементОтбора.Элементы Цикл
				ЕстьОтбор = ЕстьОтборСкидкиПоПолямСсылкиДокумента(ЭлементГруппы);
				Если ЕстьОтбор Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
			Возврат Ложь;
			
		// Элемент
		ИначеЕсли (Лев(Строка(ЭлементОтбора.ЛевоеЗначение), 16) = "ДокументПродажи."
			И ТипЗнч(ЭлементОтбора.ЛевоеЗначение) = Тип("ПолеКомпоновкиДанных"))
			Или (Лев(Строка(ЭлементОтбора.ПравоеЗначение), 16) = "ДокументПродажи."
			И ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("ПолеКомпоновкиДанных"))
		Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Поддерживает ли конфигурация скидки на сертификаты/абонементы (ручные или автоматические).
// 
// Возвращаемое значение:
//  Булево - Истина, если скидки на сертификаты возможны.
//
Функция ЕстьСкидкиНаСертификаты() Экспорт
	
	// В будущем можно переделать.
	Возврат Метаданные.Документы.ОказаниеУслуг.ТабличныеЧасти.Сертификаты.Реквизиты.Найти("ПроцентСкидки") <> Неопределено;
	
КонецФункции

#КонецОбласти
